package main

func guessDyna(name string) string {
    dynaMap := map[string]string{
        "李渊": "唐朝",
        "李世民": "唐朝",
        "李治": "唐朝",
        "武则天": "唐朝",
        "李隆基": "唐朝",
        "赵匡胤": "宋朝",
        "赵光义": "宋朝",
        "赵桓": "宋朝",
        "赵构": "宋朝",
        "忽必烈": "元朝",
        "铁木真": "元朝",
        "朱元璋": "明朝",
        "朱棣": "明朝",
        "朱由检": "明朝",
        "爱新觉罗·福临": "清朝",
        "爱新觉罗·玄烨": "清朝",
        "爱新觉罗·弘历": "清朝",
        "爱新觉罗·载淳": "清朝",
    }
    return dynaMap[name]
}