def solve():
    n = int(input())
    dynasties = {
        "夏": (2070, 1600),
        "商": (1600, 1046),
        "西周": (1046, 771),
        "春秋": (770, 476),
        "战国": (475, 221),
        "秦": (221, 206),
        "西汉": (202, 8),
        "新": (8, 23),
        "东汉": (25, 220),
        "三国": (220, 280),
        "西晋": (266, 316),
        "东晋": (317, 420),
        "南北朝": (420, 589),
        "隋": (581, 618),
        "唐": (618, 907),
        "五代": (907, 960),
        "宋": (960, 1279),
        "元": (1271, 1368),
        "明": (1368, 1644),
        "清": (1644, 1912)
    }

    for _ in range(n):
        year = int(input())
        result = "Unknown"
        for dynasty, (start, end) in dynasties.items():
            if start <= year <= end:
                result = dynasty
                break
        print(result)

solve()